# PropagateToViews Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DatumPlane..::..PropagateToViews Method
DatumPlane Class See Also
---
Propagates the extents applied to this datum in the view to the specified parallel views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void PropagateToViews(
	View view,
	ISet<ElementId> parallelViews
)
```

Visual Basic
---
```text
Public Sub PropagateToViews ( _
	view As View, _
	parallelViews As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void PropagateToViews(
	View^ view,
	ISet<ElementId^>^ parallelViews
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view on which the DatumPlane shows.
parallelViews
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The ids of the specified parallel views.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The datum plane cannot be visible in the view. -or- One ElementId in parallelViews is not valid for extent propagation. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DatumPlane Class
Autodesk.Revit.DB Namespace